#1. Функция num_translate возвращает строку перевод. Или возвращает None, если перевести невозможно.
#2.Обратите внимание, что возвращается None как объект, а не как строка "None". Не путайте печать значения (print) и его возврат из функции (return).
# Функция принимает параметр - строку слово для перевода, и другие параметры, если нужно - по вашему усмотрению. В примере специально они не указаны.
# 3.Здесь нет требований на регистр входного слова. Возвращается результат в нижнем регистре.
# 4. Выполнить вызов функции для нескольких слов и вывести на экран результаты.
def num_translate (slovo):
    numbers = dict(zero='ноль',one='один',two='два',three='три',four='четыре',five='пять',six='шесть',
    seven='семь',eight='восемь',nine='девять',ten='десять')
    c = numbers[slovo]
    print(c)
num_translate('one')
num_translate('nine')
num_translate('four')