#. Написать функцию thesaurus(), принимающую в качестве аргументов имена сотрудников и возвращающую словарь,
# в котором ключи — первые буквы имен, а значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# Количество передаваемых имен в функцию может быть любым. Считаем, что переданы будут только корректные строки.
# Обратите внимание, что функция принимает произвольное количество параметров.
# Вернуть словарь с ключами, отсортированными в алфавитном порядке.
# Выполнить вызов функции для списка имен и вывести на экран словарь.
# Вы можете вывести на экран «красиво» - как в примере на каждой строке одна буква и список, но это не обязательно.
humans = "Иван", "Мария", "Петр", "Илья", "Артем", "Вадим", "Анатолий"
def thesaurus(humans):
    names = {}
    for allnames in humans:
        key = allnames[0]
        if key in names:
            names[key].append(allnames)
        if allnames[0] not in names:
            names[allnames[0]]=[allnames]
    listk = list(names.keys())
    listk.sort()
    for i in listk:
        print(i,':',names[i])
thesaurus(humans)
