#3. Написать декоратор для логирования(вывод в консоль) типов позиционных аргументов функции:
#Если аргументов несколько - выводить данные о каждом через запятую.
#Все выводы должны быть внутри функции-обертки/задекорированной функции
#После того как вы «обернули»/«задекорировали» функцию убедитесь что и аргументы, и возвращаемое значение остались как у исходной функции.
#Т.е. вызов задекорированной функции ничем не отличается от вызова исходной функции, результат возвращается такой же, но добавляется печать в консоль.