#1. Создать список, содержащий цены на товары (10 – 20 товаров), например: [57.8, 46.51, 97, ...]
#2. Вывести на экран эти цены через запятую в одну строку, цена должна отображаться в виде <r> руб <kk> коп
#(например «5 руб 04 коп»). Обратите внимание на изменение формата вывода.
# 3. Вывести на экран цены(как числа), отсортированные по возрастанию,
#новый список для этого не создавать (показать, что объект списка после сортировки остался тот же).
#Создать новый список, содержащий те же цены, но отсортированные по убыванию. Показать, что это другой список, другой объект,
# 4. Вывести цены пяти самых дорогих товаров.
Products = [1.70,25,23.30,66.5,2,145,199.9,300,12,13.5]
for all_products in Products:
    r = int(all_products)
    k = all_products - int(all_products)
    k1 = int(k*100)
    print (f'{r} руб {k1:02} коп',end=" , ")
print()
print("Доказательство операции in place:")
print(id(Products))
Products.sort()
print(Products)
print(id(Products))
ProductsR = sorted(Products,reverse=True)
print(ProductsR)
print(id(ProductsR))
print(ProductsR[0:6])














