# Дан список строк. Выполнить обработку списка (смотри текст задания) и сформировать на его основе строку
#Техническое задание:

#Список может содержать произвольное кол-во элементов. Все его элементы - строки.
#Примеры исходного списка:
#['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
#['примерно в', '23', 'часа', '8', 'минут', '03', 'секунд', 'температура', 'воздуха',
# 'была', '-5', 'градусов Цельсия', 'темп', 'воды', '+12', 'градусов', 'Цельсия']
list = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
while list ==
