#Выяснить тип результата следующих выражений:
#15 * 3
#15 / 3
#15 // 2
#15 ** 2
# Вывести на экран тип выражения и отдельно проверить является ли полученный тип целым числом.
a = 3313
a1 = a * 3
a2 = a / 3
a3 = a // 2
a4 = a ** 2
a5 = [a1,a2,a3,a4]
for k in a5:
    print(type(k))
    if type(k) == int:
        print('True')
    else:
        print('False')
