# Вывести фразу «N процентов» с правильным склонением слова процент на экран
# отдельной строкой для каждого из чисел в интервале от 1 до 101
#Ваш алгоритм должен корректно работать для всех чисел интервала от 1 до 101
# Правила склонения здесь достаточно просты: всего три варианта: «процент»/«процента»/«процентов».
# 1 процент 2-4 процента 5-9,0 процентов 11-20 процентов 21-31-41-51-101 процент
num = 0
while int(num := num+1) <= 101: #Если подставить 200, тоже сработает
    if 9 < num < 15:
        print(num, 'процентов')
    elif num % 10 == 1:
        print(num, 'процент')
    elif 1 < num < 5:
        print(num, 'процента')
    elif num % 10 > 1 and num % 10 < 5:
        print(num, 'процента')
    else: print(num, 'процентов')
#Дошло как сделать только после пересмотра задачи с грузом и фурами
#Сначала решение было что-то типо такого
# num = 0
# nums1 = ( 1,21,31,41,51,61,71,81,91,101 )
# while int(num := num+1) <= 101:
#   if num in nums1:
        # print(num,'процент')
# и так числа перебирать все :)