# Есть два файла: в одном хранятся ФИО пользователей сайта, а в другом — данные об их хобби.
# Загрузить данные из обоих файлов и сформировать словарь: ключи — ФИО, значения — данные о хобби.
# Сохранить словарь в текстовый файл. Проверить сохранённые данные.
# Техническое задание
#
# Данные файлов синхронизированы построчно: 1-ой строке файла с ФИО соответствует 1-ая строка файла с хобби и т.п.
# При хранении данных используется принцип: одна строка — один пользователь.
# Разделитель между значениями — запятая. Не используем пакеты для парсинга CSV файлов. При формировании словаря - хобби следует разделить символом «точка с запятой».
# Если в файле, хранящем данные о хобби, меньше записей, чем в файле с ФИО, то для оставшихся ФИО использовать вместо хобби None.
# Если наоборот — формируем словарь, исходя из количества ФИО и выходим из скрипта с кодом «1».
content = open('task6_3_users.csv','r',encoding='utf-8')
content1 = open('task6_3_hobby.csv','r',encoding='utf-8')
file1 = open('task6_3_rezult.txt', mode='wt', encoding='utf-8')
users = content.read()
hobby = content1.read()
users1 = users.split()
hobby1 = hobby.replace(",", ";")
hobby2 = hobby1.split('\n')
all = {}
n = 0
for key in users1:
    keyn = key.split(',')
    keyn2 = keyn[0][0] + keyn[1][0] + keyn[2][0]
    if n < len(hobby2):
        all[keyn2] = hobby2[n]
        n = n + 1
    elif n >= len(hobby2):
        all[keyn2] = None
print(all)
file1.write(str(all))
file1.close()






