#4. Задан список чисел. Необходимо создать список, содержащий те его элементы, значения которых больше предыдущего.
# Техническое задание
#
# Здесь нет условия создавать итератор/генератор. Можно использовать comprehensions.
# Формально первый элемент сравнить не с чем. Решите сами, что с ним делать: включать в новый список или нет. Можете сравнить его с последним элементом.
#
#Примеры/Тесты:
##src = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
##result = [12, 44, 4, 10, 78, 123]
src = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
list1 = []
if src[0] > src[-1]:
    list1 = list1 + [src[0]]
for i in range(1,len(src)):
    if src[i] > src[i-1]:
        list1 = list1 + [src[i]]
print(list1)
#print(type(list1[0]))
# Если честно не понимаю как написать comprehensions, пока не дошло как это в одну строку всунуть, выбивает ошибки :(
# Надеюсь и так примите