#5. Задан список чисел. Определить элементы списка, не имеющие повторений.
# Сформировать из этих элементов список с сохранением порядка их следования в исходном списке
#Техническое задание:
#Здесь нет условия создавать итератор/генератор или comprehensions.
#Сохранение исходного порядка в результирующем списке обязательно.
#Не используйте Counter из модуля collections или аналогичные.
#result = [23, 1, 3, 10, 4, 11]
src = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]
src2 = set(src)
list = []
#print(src2)
for i in src:
    if i not in src2:
        src2.add(i)
    else: src2.discard(i)
for n in src:
    if n not in src2:
        list.append(n)
print(list)
# Сам не понял как это произошло, просто почитал методичку и написал как там ну и чуть добавил свой конец, выглядит не очень, но работает
# жду комментарий по улучшению