# 2. Написать генератор нечётных чисел от 1 до n (включительно), используя ключевое слово yield. Полностью истощить генератор.
# Техническое задание
#
# Все пункты ТЗ задания 1 остаются в силе.
# Отличие от задания 1 - только в использовании yield.
n = 15
def iterator_yield(n):
    for i in range(1, n+1, 2):
        yield i
gen1 = iterator_yield(n)
#print(gen1)
for i1 in gen1:
    print(i1)


