#2. Реализовать класс Road (дорога).
#Техническое задание:

#определить атрибуты: length (длина), width (ширина). Подумайте атрибуты чего?
#значения атрибутов должны передаваться при создании экземпляра класса
#атрибуты сделать защищёнными
#определить метод расчёта массы асфальта, необходимого для покрытия всей дороги
#метод возвращает массу асфальта в виде строки в требуемом формате (см примеры/тесты)
#формула 'длина * ширина * масса асфальта для покрытия одного кв. метра дороги асфальтом, толщиной в 1 см * число см толщины полотна';
#проверить работу метода и вывести массу асфальта для 2-3 наборов параметров.
#Примеры/Тесты:
#'20 м*5000 м*25 кг*5 см = 12500 т'

class Road:
    def __init__(self,length,width):
        self._length = length
        self._width = width
        self.mass = 25
        self.cm = 5
    def massa_asphalt(self,length,width):
        rez = ''
        formula = self._length*self._width*self.mass*self.cm//1000
        rez = f"{length}м*{width}м*{self.mass}кг*{self.cm}см = {formula} тонн"
        return rez
road1 = Road(20,5000)
print(road1.massa_asphalt(20,5000))
road2 = Road(10,3000)
print(road2.massa_asphalt(10,3000))
road3 = Road(10,200)
print(road3.massa_asphalt(10,200))
